package please.help.resources.commands;

import java.util.ListResourceBundle;

public class CommandsResources_sr_RS extends ListResourceBundle {
    @Override
    protected Object[][] getContents() {
        return new Object[][]{
                {"invalidCommand", "Команда је погрешно унета."},
                {"countValidateError", "Треба унети вредност типа Доубле."},
                {"countScriptValidateError", "Команда се мора унети заједно са вредношћу типа Доубле."},
                {"emptyLoginError", "Пријава не може бити празно поље"},
                {"spacesInLoginError", "У пријави не би требало бити размака"},
                {"shortPasswordError", "Лозинка треба да се састоји од најмање 5 знакова"},
                {"spacesInPasswordError", "Не би требало бити размака у лозинци"},
                {"differentPasswordsError", "Лозинке се разликују"},
                {"averageTitle", "Средња вредност годишњег промета"},
                {"countTitle", "Бројање вредности годишњег промета"},
                {"historyTitle", "Историја"},
                {"infoTitle", "Информације о колекцији"},
                {"typeTitle", "Типови објеката у растућем редоследу"},
                {"removeValidateError", "Команда се мора унети заједно са вредношћу типа long."},
                {"showError", "Немогуће је штампати колекцију-погрешан одговор са сервера."},
                {"helpText", "листа доступних команди за скрипту: \n" +
                        "help : прикажи помоћ по приступачним тимовима\n" +
                        "info: унесите информације о у стандардни излазни ток" +
                        "колекције (тип, број елемената, итд) \n" +
                        "show: ставите у стандардни излазни ток све ставке колекције\n" +
                        "add {element} : додај нову ставку у колекцију\n" +
                        "update id {element}: ажурирајте вредност елемента колекције чији је id једнак датом\n" +
                        "remove_by_id id : уклоните ставку из колекције помоћу ИД\n" +
                        "clear: уклоните из колекције све ставке које припадају кориснику\n" +
                        "execute_script file_name: бројање и извршавање скрипте из наведене датотеке \n" +
                        "add_if_max {element}: додајте нови елемент у колекцију ако" +
                        "његова вредност прелази вредност највећег елемента" +
                        "ове колекције (сортирање по пољу аннуалтурновер) \n" +
                        "remove_greater {element}: уклоните све елементе из колекције," +
                        "прекорачење датог (сортирање по пољу аннуалтурновер) \n" +
                        "history : прикажи последњих 5 тимова (без аргумената)\n" +
                        "average_of_annual_turnover: закључите просек поља annualTurnover" +
                        "за све елементе колекције\n" +
                        "count_by_annual_turnover annualTurnover: закључити број елемената," +
                        "вредност поља аннуалтурновер која је једнака датом \n" +
                        "print_field_ascending_type: излаз вредности поља типе свих елемената у" +
                        "узлазним редоследом \n"}
        };
    }
}
